cl-cvd.org
#+AUTHOR: Riley E.
#+TITLE: Common Lisp Chinese Vocabulary Drill.
#+OPTIONS: toc:2 num:2
#+LATEX_HEADER:\usepackage[margin=1.5cm]{geometry}
#+BEGIN_SRC lisp :session :eval no :tangle cl-cvd.lisp

  ;; Copyright (C) 2014 Riley E.

  ;; This program is free software: you can redistribute it and/or
  ;; modify it under the terms of the GNU General Public License as
  ;; published by the Free Software Foundation, either version 3 of
  ;; the License, or (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public
  ;; License along with this program. If not, see
  ;; <http://www.gnu.org/licenses/>.


#+End_SRC

* Headers, Variables, Parameters
** System description
The Chinese Vocab Drill software is written largely out of a desire for learning
more Common Lisp, better programming techniques, and the Chinese Mandarin
language. All editing is done in the .ORG file, and exported to PDF and HTML,
and the source code is "tangled" from the code blocks into the appropriate Lisp
files. This package takes advantage of several libraries:
 - [[http://common-lisp.net/project/iterate/][iterate]]:
  + The iterate package was written as a more Lispy and extensible alternative to
    the standard LOOP macro.
 - [[http://weitz.de/cl-ppcre/][cl-ppcre]]:
  + A fast regular expression library, allows for sophisticated methods for
    pattern matching, including creating of Scanners.
 - [[http://common-lisp.net/project/external-program/][external-program]]:
  + Allows an implementation-neutral access to external programs.
 - [[http://common-lisp.net/project/bordeaux-threads/][bordeaux-threads]]
  + a system for launching and managing threads as long as your Lisp system
    provides support for them.

** System Definition
#+BEGIN_SRC lisp :session :eval no :tangle cl-cvd.asd
  (asdf:defsystem #:cl-cvd
    :serial t
    :description "Chinese Vocabulary Drill"
    :author "Riley E."
    :license "GPLv3 or Later"
    :depends-on (:iterate
                  :cl-ppcre
                  :cl-csv
                  :external-program
                  :bordeaux-threads
                  :cl-cffi-gtk)
    :components ((:file "package")
                 (:file "cl-cvd")
                 (:file "cl-cvd-gui")
                 (:file "csv-import")))
#+END_SRC

** Package Definition
#+BEGIN_SRC lisp :session :eval no :tangle package.lisp
  (defpackage #:chinese-vocab-drill
    (:nicknames #:cl-cvd)
    (:use :iterate :bordeaux-threads :cl-ppcre
          :cl-csv :gtk :gdk :gobject :glib :pango
          :cairo :cffi :external-program :cl))
#+END_SRC

