cl-cvd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Common Lisp Chinese Vocabulary Drill.</title>
<!-- 2014-11-20 Thu 13:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Riley E." />
</head>
<body>
<div id="content">
<h1 class="title">Common Lisp Chinese Vocabulary Drill.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Headers, Variables, Parameters</a>
<ul>
<li><a href="#sec-1-1">1.1. System description</a></li>
<li><a href="#sec-1-2">1.2. System Definition</a></li>
<li><a href="#sec-1-3">1.3. Package Definition</a></li>
<li><a href="#sec-1-4">1.4. Global variables, and setting the package</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Structures</a></li>
<li><a href="#sec-3">3. Comma-separated value import utilities</a>
<ul>
<li><a href="#sec-3-1">3.1. Pre-parsing</a></li>
<li><a href="#sec-3-2">3.2. Separating components</a></li>
<li><a href="#sec-3-3">3.3. Final structuring of data</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Data-store utility functions</a>
<ul>
<li><a href="#sec-4-1">4.1. element-of-truth</a></li>
<li><a href="#sec-4-2">4.2. gen-ht-key</a></li>
<li><a href="#sec-4-3">4.3. key-exists-p</a></li>
<li><a href="#sec-4-4">4.4. puthash</a></li>
<li><a href="#sec-4-5">4.5. hash-table searching functions</a></li>
<li><a href="#sec-4-6">4.6. add-entry</a></li>
<li><a href="#sec-4-7">4.7. revise-entry</a></li>
<li><a href="#sec-4-8">4.8. append-english</a></li>
<li><a href="#sec-4-9">4.9. update-score</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Storage</a>
<ul>
<li><a href="#sec-5-1">5.1. Saving and Loading</a></li>
<li><a href="#sec-5-2">5.2. fill-mp3-paths</a></li>
<li><a href="#sec-5-3">5.3. matching vocab entries to mp3s</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Testing Facilities</a>
<ul>
<li><a href="#sec-6-1">6.1. set comparisons</a></li>
<li><a href="#sec-6-2">6.2. load-from-hsk</a></li>
<li><a href="#sec-6-3">6.3. enumerate-qualified-elements</a></li>
<li><a href="#sec-6-4">6.4. refil-testing-pool</a></li>
<li><a href="#sec-6-5">6.5. hsk-spillover</a></li>
<li><a href="#sec-6-6">6.6. Vocab element qualification</a></li>
<li><a href="#sec-6-7">6.7. Presentation</a></li>
<li><a href="#sec-6-8">6.8. List construction</a></li>
<li><a href="#sec-6-9">6.9. Scoring</a></li>
<li><a href="#sec-6-10">6.10. display-and-play</a></li>
<li><a href="#sec-6-11">6.11. test-loop</a></li>
<li><a href="#sec-6-12">6.12. random-test</a></li>
</ul>
</li>
<li><a href="#sec-7">7. User Interface</a>
<ul>
<li><a href="#sec-7-1">7.1. Header</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Copyright (C) 2014 Riley E.</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">This program is free software: you can redistribute it and/or</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">modify it under the terms of the GNU General Public License as</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">published by the Free Software Foundation, either version 3 of</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">the License, or (at your option) any later version.</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">This program is distributed in the hope that it will be useful,</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">but WITHOUT ANY WARRANTY; without even the implied warranty of</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">GNU General Public License for more details.</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">You should have received a copy of the GNU General Public</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">License along with this program. If not, see</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;"><a href="http://www.gnu.org/licenses/">&lt;http://www.gnu.org/licenses/&gt;</a>.</span>
</pre>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Headers, Variables, Parameters</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> System description</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The Chinese Vocab Drill software is written largely out of a desire for learning
more Common Lisp, better programming techniques, and the Chinese Mandarin
language. All editing is done in the .ORG file, and exported to PDF and HTML,
and the source code is "tangled" from the code blocks into the appropriate Lisp
files. This package takes advantage of several libraries:
</p>
<ul class="org-ul">
<li><a href="http://common-lisp.net/project/iterate/">iterate</a>:
<ul class="org-ul">
<li>The iterate package was written as a more Lispy and extensible alternative to
the standard LOOP macro.
</li>
</ul>
</li>
<li><a href="http://weitz.de/cl-ppcre/">cl-ppcre</a>:
<ul class="org-ul">
<li>A fast regular expression library, allows for sophisticated methods for
pattern matching, including creating of Scanners.
</li>
</ul>
</li>
<li><a href="http://common-lisp.net/project/external-program/">external-program</a>:
<ul class="org-ul">
<li>Allows an implementation-neutral access to external programs.
</li>
</ul>
</li>
<li><a href="http://common-lisp.net/project/bordeaux-threads/">bordeaux-threads</a>
<ul class="org-ul">
<li>a system for launching and managing threads as long as your Lisp system
provides support for them.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> System Definition</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span>asdf:defsystem #<span style="color: #DCDCCC; font-weight: bold;">:cl-cvd</span>
  <span style="color: #DCDCCC; font-weight: bold;">:serial</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:description</span> <span style="color: #CC9393;">"Chinese Vocabulary Drill"</span>
  <span style="color: #DCDCCC; font-weight: bold;">:author</span> <span style="color: #CC9393;">"Riley E."</span>
  <span style="color: #DCDCCC; font-weight: bold;">:license</span> <span style="color: #CC9393;">"GPLv3 or Later"</span>
  <span style="color: #DCDCCC; font-weight: bold;">:depends-on</span> <span style="color: #BFEBBF;">(</span><span style="color: #DCDCCC; font-weight: bold;">:iterate</span>
                <span style="color: #DCDCCC; font-weight: bold;">:cl-ppcre</span>
                <span style="color: #DCDCCC; font-weight: bold;">:cl-csv</span>
                <span style="color: #DCDCCC; font-weight: bold;">:external-program</span>
                <span style="color: #DCDCCC; font-weight: bold;">:bordeaux-threads</span>
                <span style="color: #DCDCCC; font-weight: bold;">:cl-cffi-gtk</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:components</span> <span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span><span style="color: #DCDCCC; font-weight: bold;">:file</span> <span style="color: #CC9393;">"package"</span><span style="color: #D0BF8F;">)</span>
               <span style="color: #D0BF8F;">(</span><span style="color: #DCDCCC; font-weight: bold;">:file</span> <span style="color: #CC9393;">"cl-cvd"</span><span style="color: #D0BF8F;">)</span>
               <span style="color: #D0BF8F;">(</span><span style="color: #DCDCCC; font-weight: bold;">:file</span> <span style="color: #CC9393;">"cl-cvd-gui"</span><span style="color: #D0BF8F;">)</span>
               <span style="color: #D0BF8F;">(</span><span style="color: #DCDCCC; font-weight: bold;">:file</span> <span style="color: #CC9393;">"csv-import"</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Package Definition</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defpackage</span> #<span style="color: #DCDCCC; font-weight: bold;">:chinese-vocab-drill</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #DCDCCC; font-weight: bold;">:nicknames</span> #<span style="color: #DCDCCC; font-weight: bold;">:cl-cvd</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #DCDCCC; font-weight: bold;">:use</span> <span style="color: #DCDCCC; font-weight: bold;">:iterate</span> <span style="color: #DCDCCC; font-weight: bold;">:bordeaux-threads</span> <span style="color: #DCDCCC; font-weight: bold;">:cl-ppcre</span>
        <span style="color: #DCDCCC; font-weight: bold;">:cl-csv</span> <span style="color: #DCDCCC; font-weight: bold;">:gtk</span> <span style="color: #DCDCCC; font-weight: bold;">:gdk</span> <span style="color: #DCDCCC; font-weight: bold;">:gobject</span> <span style="color: #DCDCCC; font-weight: bold;">:glib</span> <span style="color: #DCDCCC; font-weight: bold;">:pango</span>
        <span style="color: #DCDCCC; font-weight: bold;">:cairo</span> <span style="color: #DCDCCC; font-weight: bold;">:cffi</span> <span style="color: #DCDCCC; font-weight: bold;">:external-program</span> <span style="color: #DCDCCC; font-weight: bold;">:cl</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
