cl-cvd.org
** Global variables, and setting the package
Initialize the hash-table, and the hash-table element counter, which is used for
generating the keys used to identify hash-table entries.
#+BEGIN_SRC lisp :session :eval no :tangle cl-cvd.lisp
  (in-package :cl-cvd)

    ;;; The constant PHI is used for spaced-repetition timing
  (defconstant phi 1.618033988749895d0
    "The constant PHI, The golden ratio.")

  (defvar *zh-hash-table* (make-hash-table)
    "Hash table for storing data of, and
      metadata about the vocabulary listing")

  (defvar *mp3dir* nil)

  (defvar *mp3-alist* nil)

  (defvar *vocab-key-count* 0
    "Counter for the list of vocabulary entries,
      is incremented on addition of elements, or set
      when a data-set is loaded into the hash-table
      by the `import-vocab' function.")

  (defvar *test-pool* nil
    "Words that have been seen during a practice session")

  (defvar *current-hsk-level* 1)
#+END_SRC

* Structures
- Vocab Entry:
 + The =vocab-entry= data-structure provides the scaffolding for each
   vocabulary item, as well as the metadata about each item, such as times
   correct, time incorrect, last practice date, and number of total
   repetitions.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defstruct vocab-entry
    (hsk     1                    :type integer)
    (hanzi   ""                   :type string)
    (pinyin  ""                   :type string)
    (english (list "")            :type list)
    (seealso (list "")            :type list)
    (units   (list "")            :type list)
    (score   (complex 0.0 0.0)    :type complex)
    (date    (get-universal-time) :type integer)
    (reps    1                    :type integer))
#+END_SRC
#+RESULTS:
: VOCAB-ENTRY

* Comma-separated value import utilities
** Pre-parsing
*** preprocess-english
Break up the generic English description rendered from the CSV by
splitting it at each semicolon.
#+BEGIN_SRC lisp :session :eval yes :tangle csv-import.lisp
  (defun preprocess-english (desc-string)
    (car (read-csv desc-string :separator #\SEMICOLON)))
#+END_SRC
#+RESULTS:
: PREPROCESS-ENGLISH

*** collect-measures
Collect all applicable notes concerning units of measurement related to words
and generate a list of them. First checking to see if the object is a string at
all, then if the length is greater than four (to prevent errors, and because it
is a waste of time to scan such strings), then if the string begins with the
characters which designate a unit (in this case, "CL:".)
#+BEGIN_SRC lisp :session :eval yes :tangle csv-import.lisp
  (defun collect-measures (l)
    (iterate (for s in l)
      (when (and (stringp s)
                 (< 4 (length s))
                 (string= (subseq s 0 3) "CL:"))
        (collect s))))
#+END_SRC
#+RESULTS:
: COLLECT-MEASURES

*** clean-measures
Prune the "CL:" from the head of measures to make displaying nicer.
#+BEGIN_SRC lisp :session :eval yes :tangle csv-import.lisp
  (defun clean-measures (s)
    (regex-replace "CL:" s ""))
#+END_SRC
#+RESULTS:
: CLEAN-MEASURES

*** flatten
Flatten nested lists. Pulled from [[http://letoverlambda.com][Let Over Lambda]] Credit goes to Doug Hoyte.
#+BEGIN_SRC lisp :session :eval yes :tangle csv-import.lisp
  (defun flatten (x)
    (labels ((rec (x acc)
               (cond ((null x) acc)
                     ((atom x) (cons x acc))
                     (t (rec (car x)
                             (rec (cdr x) acc))))))
      (rec x nil)))
#+END_SRC
#+RESULTS:
: FLATTEN

