cl-cvd.html

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Global variables, and setting the package</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Initialize the hash-table, and the hash-table element counter, which is used for
generating the keys used to identify hash-table entries.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">in-package</span> <span style="color: #DCDCCC; font-weight: bold;">:cl-cvd</span><span style="color: #DCDCCC;">)</span>

  <span style="color: #5F7F5F;">;;; </span><span style="color: #7F9F7F;">The constant PHI is used for spaced-repetition timing</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defconstant</span> <span style="color: #DFAF8F;">phi</span> 1.618033988749895d0
  <span style="color: #CC9393;">"The constant PHI, The golden ratio."</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">*zh-hash-table*</span> <span style="color: #BFEBBF;">(</span>make-hash-table<span style="color: #BFEBBF;">)</span>
  <span style="color: #9FC59F;">"Hash table for storing data of, and</span>
<span style="color: #9FC59F;">    metadata about the vocabulary listing"</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">*mp3dir*</span> nil<span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">*mp3-alist*</span> nil<span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">*vocab-key-count*</span> 0
  <span style="color: #9FC59F;">"Counter for the list of vocabulary entries,</span>
<span style="color: #9FC59F;">    is incremented on addition of elements, or set</span>
<span style="color: #9FC59F;">    when a data-set is loaded into the hash-table</span>
<span style="color: #9FC59F;">    by the `</span><span style="color: #BFEBBF;">import-vocab</span><span style="color: #9FC59F;">' function."</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">*test-pool*</span> nil
  <span style="color: #9FC59F;">"Words that have been seen during a practice session"</span><span style="color: #DCDCCC;">)</span>

<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">*current-hsk-level*</span> 1<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Structures</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Vocab Entry:
<ul class="org-ul">
<li>The <code>vocab-entry</code> data-structure provides the scaffolding for each
vocabulary item, as well as the metadata about each item, such as times
correct, time incorrect, last practice date, and number of total
repetitions.
</li>
</ul>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defstruct</span> <span style="color: #7CB8BB;">vocab-entry</span>
  <span style="color: #BFEBBF;">(</span>hsk     1                    <span style="color: #DCDCCC; font-weight: bold;">:type</span> integer<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>hanzi   <span style="color: #CC9393;">""</span>                   <span style="color: #DCDCCC; font-weight: bold;">:type</span> string<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>pinyin  <span style="color: #CC9393;">""</span>                   <span style="color: #DCDCCC; font-weight: bold;">:type</span> string<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>english <span style="color: #D0BF8F;">(</span>list <span style="color: #CC9393;">""</span><span style="color: #D0BF8F;">)</span>            <span style="color: #DCDCCC; font-weight: bold;">:type</span> list<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>seealso <span style="color: #D0BF8F;">(</span>list <span style="color: #CC9393;">""</span><span style="color: #D0BF8F;">)</span>            <span style="color: #DCDCCC; font-weight: bold;">:type</span> list<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>units   <span style="color: #D0BF8F;">(</span>list <span style="color: #CC9393;">""</span><span style="color: #D0BF8F;">)</span>            <span style="color: #DCDCCC; font-weight: bold;">:type</span> list<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>score   <span style="color: #D0BF8F;">(</span>complex 0.0 0.0<span style="color: #D0BF8F;">)</span>    <span style="color: #DCDCCC; font-weight: bold;">:type</span> complex<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>date    <span style="color: #D0BF8F;">(</span>get-universal-time<span style="color: #D0BF8F;">)</span> <span style="color: #DCDCCC; font-weight: bold;">:type</span> integer<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>reps    1                    <span style="color: #DCDCCC; font-weight: bold;">:type</span> integer<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Comma-separated value import utilities</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Pre-parsing</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">preprocess-english</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Break up the generic English description rendered from the CSV by
splitting it at each semicolon.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">preprocess-english</span> <span style="color: #BFEBBF;">(</span>desc-string<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>car <span style="color: #D0BF8F;">(</span>read-csv desc-string <span style="color: #DCDCCC; font-weight: bold;">:separator</span> #\SEMICOLON<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2">collect-measures</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Collect all applicable notes concerning units of measurement related to words
and generate a list of them. First checking to see if the object is a string at
all, then if the length is greater than four (to prevent errors, and because it
is a waste of time to scan such strings), then if the string begins with the
characters which designate a unit (in this case, "CL:".)
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">collect-measures</span> <span style="color: #BFEBBF;">(</span>l<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>iterate <span style="color: #D0BF8F;">(</span>for s in l<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>stringp s<span style="color: #9FC59F;">)</span>
               <span style="color: #9FC59F;">(</span>&lt; 4 <span style="color: #94BFF3;">(</span>length s<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
               <span style="color: #9FC59F;">(</span>string= <span style="color: #94BFF3;">(</span>subseq s 0 3<span style="color: #94BFF3;">)</span> <span style="color: #CC9393;">"CL:"</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>collect s<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3">clean-measures</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Prune the "CL:" from the head of measures to make displaying nicer.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">clean-measures</span> <span style="color: #BFEBBF;">(</span>s<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>regex-replace <span style="color: #CC9393;">"CL:"</span> s <span style="color: #CC9393;">""</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4">flatten</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Flatten nested lists. Pulled from <a href="http://letoverlambda.com">Let Over Lambda</a> Credit goes to Doug Hoyte.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">flatten</span> <span style="color: #BFEBBF;">(</span>x<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">labels</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>rec <span style="color: #9FC59F;">(</span>x acc<span style="color: #9FC59F;">)</span>
             <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">cond</span> <span style="color: #94BFF3;">(</span><span style="color: #E0CF9F;">(</span>null x<span style="color: #E0CF9F;">)</span> acc<span style="color: #94BFF3;">)</span>
                   <span style="color: #94BFF3;">(</span><span style="color: #E0CF9F;">(</span>atom x<span style="color: #E0CF9F;">)</span> <span style="color: #E0CF9F;">(</span>cons x acc<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
                   <span style="color: #94BFF3;">(</span>t <span style="color: #E0CF9F;">(</span>rec <span style="color: #8FB28F;">(</span>car x<span style="color: #8FB28F;">)</span>
                           <span style="color: #8FB28F;">(</span>rec <span style="color: #6CA0A3;">(</span>cdr x<span style="color: #6CA0A3;">)</span> acc<span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>rec x nil<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
