cl-cvd.org
*** finalize-measures
Take the collected measures, split them by commas into separate
strings, and flatten the resulting structure.
#+BEGIN_SRC lisp :session :eval yes :tangle csv-import.lisp
  (defun finalize-measures (l)
    (let ((objet-petit-a (collect-measures l)))
      (unless (zerop (length objet-petit-a))
        (flatten
         (mapcar #'cl-csv:read-csv
                 (mapcar #'clean-measures objet-petit-a))))))
#+END_SRC
#+RESULTS:
: FINALIZE-MEASURES

*** clean-english
Remove all entries that are not themselves translations of the term,
but relate to either units of measurement, or hint to related terms.
#+BEGIN_SRC lisp :session :eval yes :tangle csv-import.lisp
  (defun clean-english (l)
    (remove-if (lambda (s)
                 (or
                  (and (< 8 (length s))
                       (or (string= (subseq s 0 8) "see also")
                           (string= (subseq s 0 9) "(see also")))
                  (and (< 4 (length s))
                       (string= (subseq s 0 3) "CL:"))))
               l))
#+END_SRC
#+RESULTS:
: CLEAN-ENGLISH


** Separating components
*** collect-see-also
Collect strings from the results of =preprocess-english= that begin with "see
also".
#+BEGIN_SRC lisp :session :eval yes :tangle csv-import.lisp
  (defun collect-see-also (l)
    (iterate (for s in l)
      (when (and (stringp s)
                 (< 8 (length s))
                 (string= (subseq s 0 8) "see also"))
        (collect s))))
#+END_SRC
#+RESULTS:
: COLLECT-SEE-ALSO

** Final structuring of data
*** eleml-to-struct
Break up the s-expressionized CSV line and name the elements, then perform
various operations on each of these elements, including further breaking up into
other specific values to be stored in the vocab-entry structure.
#+BEGIN_SRC lisp :session :eval yes :tangle csv-import.lisp
  (defun eleml-to-struct (l)
    (destructuring-bind (hsk hanzi pinyin description) l
      (let* ((pre-english (preprocess-english description))
             (units       (finalize-measures  pre-english))
             (see-also    (collect-see-also   pre-english))
             (english     (clean-english      pre-english)))
        (make-vocab-entry :hsk     (read-from-string hsk)
                          :hanzi   hanzi
                          :pinyin  pinyin
                          :english english
                          :units   units
                          :seealso see-also))))
#+END_SRC
#+RESULTS:
: ELEML-TO-STRUCT

*** batch-add-table
Copy the entire result of a =parse-csv= operation into a hash table using the
predefined functions above.
#+BEGIN_SRC lisp :session :eval yes :tangle csv-import.lisp
  (defun batch-add-table (l)
    (dolist (lx l)
      (puthash (gen-ht-key 'zh-index)
               ,*zh-hash-table*
               (eleml-to-struct lx))))
#+END_SRC
#+RESULTS:
: BATCH-ADD-TABLE

* Data-store utility functions
** element-of-truth
Check a list for any non-nil values.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun element-of-truth (l)
    (iterate (for i in l)
      (when i (return i))))
#+END_SRC
#+RESULTS:
: ELEMENT-OF-TRUTH

