cl-cvd.html
<div id="outline-container-sec-3-1-5" class="outline-4">
<h4 id="sec-3-1-5">finalize-measures</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
Take the collected measures, split them by commas into separate
strings, and flatten the resulting structure.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">finalize-measures</span> <span style="color: #BFEBBF;">(</span>l<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>objet-petit-a <span style="color: #9FC59F;">(</span>collect-measures l<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">unless</span> <span style="color: #93E0E3;">(</span>zerop <span style="color: #9FC59F;">(</span>length objet-petit-a<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>flatten
       <span style="color: #9FC59F;">(</span>mapcar #'cl-csv:read-csv
               <span style="color: #94BFF3;">(</span>mapcar #'clean-measures objet-petit-a<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-1-6" class="outline-4">
<h4 id="sec-3-1-6">clean-english</h4>
<div class="outline-text-4" id="text-3-1-6">
<p>
Remove all entries that are not themselves translations of the term,
but relate to either units of measurement, or hint to related terms.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">clean-english</span> <span style="color: #BFEBBF;">(</span>l<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>remove-if <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #93E0E3;">(</span>s<span style="color: #93E0E3;">)</span>
               <span style="color: #93E0E3;">(</span>or
                <span style="color: #9FC59F;">(</span>and <span style="color: #94BFF3;">(</span>&lt; 8 <span style="color: #E0CF9F;">(</span>length s<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
                     <span style="color: #94BFF3;">(</span>or <span style="color: #E0CF9F;">(</span>string= <span style="color: #8FB28F;">(</span>subseq s 0 8<span style="color: #8FB28F;">)</span> <span style="color: #CC9393;">"see also"</span><span style="color: #E0CF9F;">)</span>
                         <span style="color: #E0CF9F;">(</span>string= <span style="color: #8FB28F;">(</span>subseq s 0 9<span style="color: #8FB28F;">)</span> <span style="color: #CC9393;">"(see also"</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
                <span style="color: #9FC59F;">(</span>and <span style="color: #94BFF3;">(</span>&lt; 4 <span style="color: #E0CF9F;">(</span>length s<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
                     <span style="color: #94BFF3;">(</span>string= <span style="color: #E0CF9F;">(</span>subseq s 0 3<span style="color: #E0CF9F;">)</span> <span style="color: #CC9393;">"CL:"</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
             l<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Separating components</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1">collect-see-also</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Collect strings from the results of <code>preprocess-english</code> that begin with "see
also".
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">collect-see-also</span> <span style="color: #BFEBBF;">(</span>l<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>iterate <span style="color: #D0BF8F;">(</span>for s in l<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>stringp s<span style="color: #9FC59F;">)</span>
               <span style="color: #9FC59F;">(</span>&lt; 8 <span style="color: #94BFF3;">(</span>length s<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
               <span style="color: #9FC59F;">(</span>string= <span style="color: #94BFF3;">(</span>subseq s 0 8<span style="color: #94BFF3;">)</span> <span style="color: #CC9393;">"see also"</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>collect s<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Final structuring of data</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1">eleml-to-struct</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Break up the s-expressionized CSV line and name the elements, then perform
various operations on each of these elements, including further breaking up into
other specific values to be stored in the vocab-entry structure.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">eleml-to-struct</span> <span style="color: #BFEBBF;">(</span>l<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">destructuring-bind</span> <span style="color: #D0BF8F;">(</span>hsk hanzi pinyin description<span style="color: #D0BF8F;">)</span> l
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">let*</span> <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>pre-english <span style="color: #94BFF3;">(</span>preprocess-english description<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
           <span style="color: #9FC59F;">(</span>units       <span style="color: #94BFF3;">(</span>finalize-measures  pre-english<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
           <span style="color: #9FC59F;">(</span>see-also    <span style="color: #94BFF3;">(</span>collect-see-also   pre-english<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
           <span style="color: #9FC59F;">(</span>english     <span style="color: #94BFF3;">(</span>clean-english      pre-english<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>make-vocab-entry <span style="color: #DCDCCC; font-weight: bold;">:hsk</span>     <span style="color: #9FC59F;">(</span>read-from-string hsk<span style="color: #9FC59F;">)</span>
                        <span style="color: #DCDCCC; font-weight: bold;">:hanzi</span>   hanzi
                        <span style="color: #DCDCCC; font-weight: bold;">:pinyin</span>  pinyin
                        <span style="color: #DCDCCC; font-weight: bold;">:english</span> english
                        <span style="color: #DCDCCC; font-weight: bold;">:units</span>   units
                        <span style="color: #DCDCCC; font-weight: bold;">:seealso</span> see-also<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2">batch-add-table</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
Copy the entire result of a <code>parse-csv</code> operation into a hash table using the
predefined functions above.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">batch-add-table</span> <span style="color: #BFEBBF;">(</span>l<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">dolist</span> <span style="color: #D0BF8F;">(</span>lx l<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>puthash <span style="color: #93E0E3;">(</span>gen-ht-key 'zh-index<span style="color: #93E0E3;">)</span>
             *zh-hash-table*
             <span style="color: #93E0E3;">(</span>eleml-to-struct lx<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Data-store utility functions</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> element-of-truth</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Check a list for any non-nil values.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">element-of-truth</span> <span style="color: #BFEBBF;">(</span>l<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>iterate <span style="color: #D0BF8F;">(</span>for i in l<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> i <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">return</span> i<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
