cl-cvd.org
** gen-ht-key
=gen-ht-key= creates the keys used for labeling objects in the hash table.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun gen-ht-key (prefix)
    (let ((the-sym-name (format nil "~D-~D" prefix (incf *vocab-key-count*))))
      (intern the-sym-name :cl-cvd)))
#+END_SRC
#+RESULTS:
: GEN-HT-KEY

** key-exists-p
Test to see if a key is already assigned within a hash-table
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun key-exists-p (key table)
    (if (gethash key table)
        t
        nil))
#+END_SRC
#+RESULTS:
: KEY-EXISTS-P

** puthash
Wrap the =setf= clause in a function for adding/modifying entries in a hash-table
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun puthash (key table object)
    (setf (gethash key table) object))
#+END_SRC
#+RESULTS:
: PUTHASH

** hash-table searching functions
*** hsk-apropos
Search for and collect items that match a specified [[http://en.wikipedia.org/wiki/Hanyu_Shuiping_Kaoshi][HSK]] level.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun hsk-apropos (level)
    (declare (fixnum level))
    (loop :for key :being the hash-keys :of *zh-hash-table*
          :for val :being the hash-value :of *zh-hash-table*
          :when (= level (the fixnum (vocab-entry-hsk val)))
            :collect key))
#+END_SRC
#+RESULTS:
: HSK-APROPOS

*** zh-apropos
Search the hash table for a matching Hanzi entry and return it with the hash key
associated with the vocabulary entry found in a list in the form =(<key>
<vocab-entry>)=.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun zh-apropos (zh-string)
    (declare (string zh-string))
    (loop :for key :being the hash-keys :of *zh-hash-table*
          :for val :being the hash-value :of *zh-hash-table*
          :when (scan zh-string (vocab-entry-hanzi val))
            :collect (list key val)))
#+END_SRC
#+RESULTS:
: ZH-APROPOS

*** zh-apropos-key
Find vocabulary entries where the provided =zh-string= is at least a subset of
the string stored in the entry's =:hanzi= slot. Return a list of hash-keys of
the relevant vocabulary entries.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun zh-apropos-key (zh-string)
    (declare (string zh-string))
    (loop :for key :being the hash-keys  :of *zh-hash-table*
          :for val :being the hash-value :of *zh-hash-table*
          :when (scan zh-string (vocab-entry-hanzi val))
            :collect key))
#+END_SRC
#+RESULTS:
: ZH-APROPOS-KEY

*** en-apropos
Find a vocab entry which contains a specified substring within its =:english= slot.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun en-apropos (en-string)
    (declare (string en-string))
    (loop :for key :being the hash-keys :of *zh-hash-table*
          :for val :being the hash-value :of *zh-hash-table*
          :when (element-of-truth
                 (mapcar (lambda (s)
                           (scan en-string s))
                         (vocab-entry-english val)))
            :collect (list key val)))
#+END_SRC
#+RESULTS:
: EN-APROPOS

