cl-cvd.html
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> gen-ht-key</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<code>gen-ht-key</code> creates the keys used for labeling objects in the hash table.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">gen-ht-key</span> <span style="color: #BFEBBF;">(</span>prefix<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>the-sym-name <span style="color: #9FC59F;">(</span>format nil <span style="color: #CC9393;">"~D-~D"</span> prefix <span style="color: #94BFF3;">(</span>incf *vocab-key-count*<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>intern the-sym-name <span style="color: #DCDCCC; font-weight: bold;">:cl-cvd</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> key-exists-p</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Test to see if a key is already assigned within a hash-table
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">key-exists-p</span> <span style="color: #BFEBBF;">(</span>key table<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #D0BF8F;">(</span>gethash key table<span style="color: #D0BF8F;">)</span>
      t
      nil<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> puthash</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Wrap the <code>setf</code> clause in a function for adding/modifying entries in a hash-table
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">puthash</span> <span style="color: #BFEBBF;">(</span>key table object<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>setf <span style="color: #D0BF8F;">(</span>gethash key table<span style="color: #D0BF8F;">)</span> object<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> hash-table searching functions</h3>
<div class="outline-text-3" id="text-4-5">
</div><div id="outline-container-sec-4-5-1" class="outline-4">
<h4 id="sec-4-5-1">hsk-apropos</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
Search for and collect items that match a specified <a href="http://en.wikipedia.org/wiki/Hanyu_Shuiping_Kaoshi">HSK</a> level.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">hsk-apropos</span> <span style="color: #BFEBBF;">(</span>level<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">declare</span> <span style="color: #D0BF8F;">(</span>fixnum level<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">loop</span> <span style="color: #DCDCCC; font-weight: bold;">:for</span> key <span style="color: #DCDCCC; font-weight: bold;">:being</span> the hash-keys <span style="color: #DCDCCC; font-weight: bold;">:of</span> *zh-hash-table*
        <span style="color: #DCDCCC; font-weight: bold;">:for</span> val <span style="color: #DCDCCC; font-weight: bold;">:being</span> the hash-value <span style="color: #DCDCCC; font-weight: bold;">:of</span> *zh-hash-table*
        <span style="color: #DCDCCC; font-weight: bold;">:when</span> <span style="color: #D0BF8F;">(</span>= level <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">the</span> fixnum <span style="color: #9FC59F;">(</span>vocab-entry-hsk val<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
          <span style="color: #DCDCCC; font-weight: bold;">:collect</span> key<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-5-2" class="outline-4">
<h4 id="sec-4-5-2">zh-apropos</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
Search the hash table for a matching Hanzi entry and return it with the hash key
associated with the vocabulary entry found in a list in the form <code>(&lt;key&gt;
&lt;vocab-entry&gt;)</code>.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">zh-apropos</span> <span style="color: #BFEBBF;">(</span>zh-string<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">declare</span> <span style="color: #D0BF8F;">(</span>string zh-string<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">loop</span> <span style="color: #DCDCCC; font-weight: bold;">:for</span> key <span style="color: #DCDCCC; font-weight: bold;">:being</span> the hash-keys <span style="color: #DCDCCC; font-weight: bold;">:of</span> *zh-hash-table*
        <span style="color: #DCDCCC; font-weight: bold;">:for</span> val <span style="color: #DCDCCC; font-weight: bold;">:being</span> the hash-value <span style="color: #DCDCCC; font-weight: bold;">:of</span> *zh-hash-table*
        <span style="color: #DCDCCC; font-weight: bold;">:when</span> <span style="color: #D0BF8F;">(</span>scan zh-string <span style="color: #93E0E3;">(</span>vocab-entry-hanzi val<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
          <span style="color: #DCDCCC; font-weight: bold;">:collect</span> <span style="color: #D0BF8F;">(</span>list key val<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-5-3" class="outline-4">
<h4 id="sec-4-5-3">zh-apropos-key</h4>
<div class="outline-text-4" id="text-4-5-3">
<p>
Find vocabulary entries where the provided <code>zh-string</code> is at least a subset of
the string stored in the entry's <code>:hanzi</code> slot. Return a list of hash-keys of
the relevant vocabulary entries.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">zh-apropos-key</span> <span style="color: #BFEBBF;">(</span>zh-string<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">declare</span> <span style="color: #D0BF8F;">(</span>string zh-string<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">loop</span> <span style="color: #DCDCCC; font-weight: bold;">:for</span> key <span style="color: #DCDCCC; font-weight: bold;">:being</span> the hash-keys  <span style="color: #DCDCCC; font-weight: bold;">:of</span> *zh-hash-table*
        <span style="color: #DCDCCC; font-weight: bold;">:for</span> val <span style="color: #DCDCCC; font-weight: bold;">:being</span> the hash-value <span style="color: #DCDCCC; font-weight: bold;">:of</span> *zh-hash-table*
        <span style="color: #DCDCCC; font-weight: bold;">:when</span> <span style="color: #D0BF8F;">(</span>scan zh-string <span style="color: #93E0E3;">(</span>vocab-entry-hanzi val<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
          <span style="color: #DCDCCC; font-weight: bold;">:collect</span> key<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-5-4" class="outline-4">
<h4 id="sec-4-5-4">en-apropos</h4>
<div class="outline-text-4" id="text-4-5-4">
<p>
Find a vocab entry which contains a specified substring within its <code>:english</code> slot.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">en-apropos</span> <span style="color: #BFEBBF;">(</span>en-string<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">declare</span> <span style="color: #D0BF8F;">(</span>string en-string<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">loop</span> <span style="color: #DCDCCC; font-weight: bold;">:for</span> key <span style="color: #DCDCCC; font-weight: bold;">:being</span> the hash-keys <span style="color: #DCDCCC; font-weight: bold;">:of</span> *zh-hash-table*
        <span style="color: #DCDCCC; font-weight: bold;">:for</span> val <span style="color: #DCDCCC; font-weight: bold;">:being</span> the hash-value <span style="color: #DCDCCC; font-weight: bold;">:of</span> *zh-hash-table*
        <span style="color: #DCDCCC; font-weight: bold;">:when</span> <span style="color: #D0BF8F;">(</span>element-of-truth
               <span style="color: #93E0E3;">(</span>mapcar <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #94BFF3;">(</span>s<span style="color: #94BFF3;">)</span>
                         <span style="color: #94BFF3;">(</span>scan en-string s<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
                       <span style="color: #9FC59F;">(</span>vocab-entry-english val<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
          <span style="color: #DCDCCC; font-weight: bold;">:collect</span> <span style="color: #D0BF8F;">(</span>list key val<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
