cl-cvd.org
*** en-apropos-word
Find a vocab entry which contains a discreet word, separated by punctuation on
either side, or at either end of the whole sequence.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun en-apropos-word (en-word)
    (declare (string en-word))
    (loop :for key :being the hash-keys :of *zh-hash-table*
          :for val :being the hash-value :of *zh-hash-table*
          :when (element-of-truth
                 (mapcar (lambda (s)
                           (find-word-in-string en-word s))
                         (vocab-entry-english val)))
            :collect (list key val)))
#+END_SRC
#+RESULTS:
: EN-APROPOS-WORD

**** find-word-in-string
Find a whole word within a provided string, delineated by an end of the
=target-string= or any predefined punctuation mark as defined within the
=punctuation-p= enclosed functions.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun find-word-in-string (word target-string)
    (declare (string word target-string))
    (multiple-value-bind (word-begin word-end) (scan word target-string)
      (when (and word-begin word-end)
        (cond ((string= word target-string) word)
              ((and (or (zerop word-begin)
                        (punctuation-p (char target-string (- word-begin 1))))
                    (or (= (length target-string) word-end)
                        (punctuation-p (char target-string word-end))))
               word)))))
#+END_SRC
#+RESULTS:
: FIND-WORD-IN-STRING

**** punctuation-p
Define a set of functions for retrieving and manipulating a stored list of
punctuation-marks and white-space characters.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (let ((punctuations (list #\SPACE #\Tab
                            #\.     #\,
                            #\;     #\:
                            #\/     #\\
                            #\|     #\!
                            #\-     #\_
                            #\(     #\) 
                            #\{     #\}
                            #\[     #\]
                            #\~     #\`
                            #\<     #\>
                            #\?     #\&
                            #\"     #\+
                            #\=)))
    
    (defun punctuation-p (chr)
      (member chr punctuations))
    
    (defun defpunct (chr)
      (unless (punctuation-p chr)
        (push chr punctuations)))
    
    (defun rempunct (chr)
      (when (punctuation-p chr)
        (setf punctuations (delete chr punctuations))))
    
    (defun get-punctuation ()
      punctuations))

#+END_SRC
#+RESULTS:
: *PUNCTUATIONS*
* Entry manipulation
** add-entry
Create a new instance of =vocab-entry= and install it into the primary
hash-table with a unique key.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun add-entry (&key hanzi pinyin english (hsk 0) (hash-table *zh-hash-table*))
    (puthash (gen-ht-key 'zh-index)
             hash-table
             (make-vocab-entry :hanzi   hanzi
                               :pinyin  pinyin
                               :english english
                               :hsk     hsk)))
#+END_SRC
#+RESULTS:
: ADD-ENTRY

