cl-cvd.html
<div id="outline-container-sec-4-5-5" class="outline-4">
<h4 id="sec-4-5-5">en-apropos-word</h4>
<div class="outline-text-4" id="text-4-5-5">
<p>
Find a vocab entry which contains a discreet word, separated by punctuation on
either side, or at either end of the whole sequence.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">en-apropos-word</span> <span style="color: #BFEBBF;">(</span>en-word<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">declare</span> <span style="color: #D0BF8F;">(</span>string en-word<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">loop</span> <span style="color: #DCDCCC; font-weight: bold;">:for</span> key <span style="color: #DCDCCC; font-weight: bold;">:being</span> the hash-keys <span style="color: #DCDCCC; font-weight: bold;">:of</span> *zh-hash-table*
        <span style="color: #DCDCCC; font-weight: bold;">:for</span> val <span style="color: #DCDCCC; font-weight: bold;">:being</span> the hash-value <span style="color: #DCDCCC; font-weight: bold;">:of</span> *zh-hash-table*
        <span style="color: #DCDCCC; font-weight: bold;">:when</span> <span style="color: #D0BF8F;">(</span>element-of-truth
               <span style="color: #93E0E3;">(</span>mapcar <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #94BFF3;">(</span>s<span style="color: #94BFF3;">)</span>
                         <span style="color: #94BFF3;">(</span>find-word-in-string en-word s<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
                       <span style="color: #9FC59F;">(</span>vocab-entry-english val<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
          <span style="color: #DCDCCC; font-weight: bold;">:collect</span> <span style="color: #D0BF8F;">(</span>list key val<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
<ul class="org-ul"><li><a id="sec-4-5-5-1" name="sec-4-5-5-1"></a>find-word-in-string<br  /><div class="outline-text-5" id="text-4-5-5-1">
<p>
Find a whole word within a provided string, delineated by an end of the
<code>target-string</code> or any predefined punctuation mark as defined within the
<code>punctuation-p</code> enclosed functions.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">find-word-in-string</span> <span style="color: #BFEBBF;">(</span>word target-string<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">declare</span> <span style="color: #D0BF8F;">(</span>string word target-string<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">multiple-value-bind</span> <span style="color: #D0BF8F;">(</span>word-begin word-end<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>scan word target-string<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #93E0E3;">(</span>and word-begin word-end<span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">cond</span> <span style="color: #9FC59F;">(</span><span style="color: #94BFF3;">(</span>string= word target-string<span style="color: #94BFF3;">)</span> word<span style="color: #9FC59F;">)</span>
            <span style="color: #9FC59F;">(</span><span style="color: #94BFF3;">(</span>and <span style="color: #E0CF9F;">(</span>or <span style="color: #8FB28F;">(</span>zerop word-begin<span style="color: #8FB28F;">)</span>
                      <span style="color: #8FB28F;">(</span>punctuation-p <span style="color: #6CA0A3;">(</span>char target-string <span style="color: #DCDCCC;">(</span>- word-begin 1<span style="color: #DCDCCC;">)</span><span style="color: #6CA0A3;">)</span><span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span>
                  <span style="color: #E0CF9F;">(</span>or <span style="color: #8FB28F;">(</span>= <span style="color: #6CA0A3;">(</span>length target-string<span style="color: #6CA0A3;">)</span> word-end<span style="color: #8FB28F;">)</span>
                      <span style="color: #8FB28F;">(</span>punctuation-p <span style="color: #6CA0A3;">(</span>char target-string word-end<span style="color: #6CA0A3;">)</span><span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
             word<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="sec-4-5-5-2" name="sec-4-5-5-2"></a>punctuation-p<br  /><div class="outline-text-5" id="text-4-5-5-2">
<p>
Define a set of functions for retrieving and manipulating a stored list of
punctuation-marks and white-space characters.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #BFEBBF;">(</span><span style="color: #D0BF8F;">(</span>punctuations <span style="color: #93E0E3;">(</span>list #\SPACE #\Tab
                          #\.     #\,
                          #\;     #\:
                          #\/     #\\
                          #\|     #\!
                          #\-     #\_
                          #\(     #\) 
                          #\{     #\}
                          #\[     #\]
                          #\~     #\`
                          #\&lt;     #\&gt;
                          #\?     #\&amp;
                          #\"     #\+
                          #\=<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>

  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">punctuation-p</span> <span style="color: #D0BF8F;">(</span>chr<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>member chr punctuations<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>

  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">defpunct</span> <span style="color: #D0BF8F;">(</span>chr<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">unless</span> <span style="color: #93E0E3;">(</span>punctuation-p chr<span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>push chr punctuations<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>

  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">rempunct</span> <span style="color: #D0BF8F;">(</span>chr<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #93E0E3;">(</span>punctuation-p chr<span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>setf punctuations <span style="color: #9FC59F;">(</span>delete chr punctuations<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>

  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">get-punctuation</span> <span style="color: #D0BF8F;">()</span>
    punctuations<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</li></ul>
</div>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> add-entry</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Create a new instance of <code>vocab-entry</code> and install it into the primary
hash-table with a unique key.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">add-entry</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB;">&amp;key</span> hanzi pinyin english <span style="color: #D0BF8F;">(</span>hsk 0<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>hash-table *zh-hash-table*<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>puthash <span style="color: #D0BF8F;">(</span>gen-ht-key 'zh-index<span style="color: #D0BF8F;">)</span>
           hash-table
           <span style="color: #D0BF8F;">(</span>make-vocab-entry <span style="color: #DCDCCC; font-weight: bold;">:hanzi</span>   hanzi
                             <span style="color: #DCDCCC; font-weight: bold;">:pinyin</span>  pinyin
                             <span style="color: #DCDCCC; font-weight: bold;">:english</span> english
                             <span style="color: #DCDCCC; font-weight: bold;">:hsk</span>     hsk<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
