cl-cvd.org
** revise-entry
Modify an entry by accepting a field parameter, and a replacement value.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun revise-entry (&key key field new-data (hash-table *zh-hash-table*))
    (let ((the-object (gethash key hash-table)))
      (case field
        ((hanzi)   (setf (vocab-entry-hanzi   the-object) new-data))
        ((pinyin)  (setf (vocab-entry-pinyin  the-object) new-data))
        ((english) (setf (vocab-entry-english the-object) new-data)))))
#+END_SRC
#+RESULTS:
: REVISE-ENTRY

** append-english
Append additional English terms to the =:english= slot in a =vocab-entry=
instance.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun append-english (english-strings &key key (hash-table *zh-hash-table*))
    (let ((the-object (gethash key hash-table)))
      (revise-entry (append (vocab-entry-english the-object) english-strings)
                    :key key
                    :field 'english)))
#+END_SRC
#+RESULTS:
: APPEND-ENGLISH

** update-score
Update the score stored in a =vocab-entry= instance based on the results of
=check-answer= and =score-result=.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun update-score (answer hash-key test-type &key (hash-table *zh-hash-table*))
    (let ((vocab-entry (gethash hash-key hash-table)))
      (setf (vocab-entry-score vocab-entry)
            (+ (vocab-entry-score vocab-entry)
               (score-result (check-answer answer vocab-entry test-type))))
      (setf (vocab-entry-date vocab-entry)
            (get-universal-time))
      (incf (vocab-entry-reps vocab-entry))))
#+END_SRC
#+RESULTS:
: UPDATE-SCORE

* Storage
** Saving and Loading
*** export-vocab
The =export-vocab= function arose out of a finding that hash-table objects
differ slightly between Common Lisp implementations.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun export-vocab (&key (vocab-table *zh-hash-table*) (filename "zh-portable.raw")) 
    (let ((the-alist) (count 0))
      (labels ((destructure-vocab (x y)
                 (push (list x y) the-alist)
                 (incf count)))
        (maphash #'destructure-vocab vocab-table)
        (with-open-file (out filename
                             :direction :output
                             :if-exists :supersede)
          (with-standard-io-syntax
            (pprint the-alist out))))
      count))
#+END_SRC
#+RESULTS:
: EXPORT-VOCAB

*** import-vocab
The obvious counterpart to =export-vocab=.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun import-vocab (&key (vocab-table *zh-hash-table*) (filename "zh-portable.raw"))
    (labels ((structure-vocab (l)
               (puthash (car l) vocab-table (cadr l))))
      (with-open-file (in filename)
        (declare (dynamic-extent in))
        (with-standard-io-syntax
          (mapcar #'structure-vocab (read in))))
      (setf *vocab-key-count* (hash-table-count *zh-hash-table*))))
#+END_SRC
#+RESULTS:
: IMPORT-VOCAB
* MP3 file Matching and Playback
MP3s and the original data-set were provided by [[lingomi.com][lingomi]].

