cl-cvd.html
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> revise-entry</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Modify an entry by accepting a field parameter, and a replacement value.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">revise-entry</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB;">&amp;key</span> key field new-data <span style="color: #D0BF8F;">(</span>hash-table *zh-hash-table*<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>the-object <span style="color: #9FC59F;">(</span>gethash key hash-table<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">case</span> field
      <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>hanzi<span style="color: #9FC59F;">)</span>   <span style="color: #9FC59F;">(</span>setf <span style="color: #94BFF3;">(</span>vocab-entry-hanzi   the-object<span style="color: #94BFF3;">)</span> new-data<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>pinyin<span style="color: #9FC59F;">)</span>  <span style="color: #9FC59F;">(</span>setf <span style="color: #94BFF3;">(</span>vocab-entry-pinyin  the-object<span style="color: #94BFF3;">)</span> new-data<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>english<span style="color: #9FC59F;">)</span> <span style="color: #9FC59F;">(</span>setf <span style="color: #94BFF3;">(</span>vocab-entry-english the-object<span style="color: #94BFF3;">)</span> new-data<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> append-english</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Append additional English terms to the <code>:english</code> slot in a <code>vocab-entry</code>
instance.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">append-english</span> <span style="color: #BFEBBF;">(</span>english-strings <span style="color: #7CB8BB;">&amp;key</span> key <span style="color: #D0BF8F;">(</span>hash-table *zh-hash-table*<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>the-object <span style="color: #9FC59F;">(</span>gethash key hash-table<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>revise-entry <span style="color: #93E0E3;">(</span>append <span style="color: #9FC59F;">(</span>vocab-entry-english the-object<span style="color: #9FC59F;">)</span> english-strings<span style="color: #93E0E3;">)</span>
                  <span style="color: #DCDCCC; font-weight: bold;">:key</span> key
                  <span style="color: #DCDCCC; font-weight: bold;">:field</span> 'english<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-9" class="outline-3">
<h3 id="sec-4-9"><span class="section-number-3">4.9</span> update-score</h3>
<div class="outline-text-3" id="text-4-9">
<p>
Update the score stored in a <code>vocab-entry</code> instance based on the results of
<code>check-answer</code> and <code>score-result</code>.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">update-score</span> <span style="color: #BFEBBF;">(</span>answer hash-key test-type <span style="color: #7CB8BB;">&amp;key</span> <span style="color: #D0BF8F;">(</span>hash-table *zh-hash-table*<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>vocab-entry <span style="color: #9FC59F;">(</span>gethash hash-key hash-table<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>setf <span style="color: #93E0E3;">(</span>vocab-entry-score vocab-entry<span style="color: #93E0E3;">)</span>
          <span style="color: #93E0E3;">(</span>+ <span style="color: #9FC59F;">(</span>vocab-entry-score vocab-entry<span style="color: #9FC59F;">)</span>
             <span style="color: #9FC59F;">(</span>score-result <span style="color: #94BFF3;">(</span><span style="color: #D0BF8F; font-weight: bold;">check-answer</span> answer vocab-entry test-type<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>setf <span style="color: #93E0E3;">(</span>vocab-entry-date vocab-entry<span style="color: #93E0E3;">)</span>
          <span style="color: #93E0E3;">(</span>get-universal-time<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>incf <span style="color: #93E0E3;">(</span>vocab-entry-reps vocab-entry<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Storage</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Saving and Loading</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1">export-vocab</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
The <code>export-vocab</code> function arose out of a finding that hash-table objects
differ slightly between Common Lisp implementations.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">export-vocab</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB;">&amp;key</span> <span style="color: #D0BF8F;">(</span>vocab-table *zh-hash-table*<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>filename <span style="color: #CC9393;">"zh-portable.raw"</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span> 
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>the-alist<span style="color: #93E0E3;">)</span> <span style="color: #93E0E3;">(</span>count 0<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">labels</span> <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>destructure-vocab <span style="color: #94BFF3;">(</span>x y<span style="color: #94BFF3;">)</span>
               <span style="color: #94BFF3;">(</span>push <span style="color: #E0CF9F;">(</span>list x y<span style="color: #E0CF9F;">)</span> the-alist<span style="color: #94BFF3;">)</span>
               <span style="color: #94BFF3;">(</span>incf count<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>maphash #'destructure-vocab vocab-table<span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">with-open-file</span> <span style="color: #9FC59F;">(</span>out filename
                           <span style="color: #DCDCCC; font-weight: bold;">:direction</span> <span style="color: #DCDCCC; font-weight: bold;">:output</span>
                           <span style="color: #DCDCCC; font-weight: bold;">:if-exists</span> <span style="color: #DCDCCC; font-weight: bold;">:supersede</span><span style="color: #9FC59F;">)</span>
        <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">with-standard-io-syntax</span>
          <span style="color: #94BFF3;">(</span>pprint the-alist out<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    count<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2">import-vocab</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
The obvious counterpart to <code>export-vocab</code>.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">import-vocab</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB;">&amp;key</span> <span style="color: #D0BF8F;">(</span>vocab-table *zh-hash-table*<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>filename <span style="color: #CC9393;">"zh-portable.raw"</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">labels</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>structure-vocab <span style="color: #9FC59F;">(</span>l<span style="color: #9FC59F;">)</span>
             <span style="color: #9FC59F;">(</span>puthash <span style="color: #94BFF3;">(</span>car l<span style="color: #94BFF3;">)</span> vocab-table <span style="color: #94BFF3;">(</span>cadr l<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">with-open-file</span> <span style="color: #93E0E3;">(</span>in filename<span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">declare</span> <span style="color: #9FC59F;">(</span>dynamic-extent in<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">with-standard-io-syntax</span>
        <span style="color: #9FC59F;">(</span>mapcar #'structure-vocab <span style="color: #94BFF3;">(</span>read in<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>setf *vocab-key-count* <span style="color: #93E0E3;">(</span>hash-table-count *zh-hash-table*<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
<p>
MP3s and the original data-set were provided by <i>lingomi</i>.
</p>
</div>
</div>
</div>
