cl-cvd.org
** fill-mp3-paths
Set the variable =*mp3dir*= to be a list of paths to each of the MP3s for the
vocab tests.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun fill-mp3-paths ()
    (setf *mp3dir* (directory #P"~/chinese/hsk_mp3/*.mp3"))
    nil)
#+END_SRC
#+RESULTS:
: FILL-MP3-PATHS

** matching vocab entries to mp3s
*** find-mp3-path
Search a list of mp3 files for a match with a predefined pinyin string.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun find-mp3-path (match-name)
    (iterate (for elt in *mp3dir*)
      (finding elt such-that (scan match-name (namestring elt)))))
#+END_SRC
#+RESULTS:
: FIND-MP3-PATH

*** find-matching-mp3
Match a given vocabulary key to a list of mp3 files
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun find-matching-mp3 (vocab-key)
    (let* ((vocab-entry (gethash vocab-key *zh-hash-table*))
           (pinyin (vocab-entry-pinyin vocab-entry))
           (nospace (regex-replace " " pinyin ""))
           (match-name (concatenate 'string "-" nospace "-"))
           (mp3-path (find-mp3-path match-name)))
      (when mp3-path
        (push (list vocab-key
                    (namestring mp3-path))
              ,*mp3-alist*))))
#+END_SRC
#+RESULTS:
: FIND-MATCHING-MP3

*** find-active-vocab-mp3s
Look for mp3s which match the contents of the =*mp3dir*= variable, if it is not
already in the =*mp3-alist*=, add it in the form of =(KEY PATH-TO-MP3)=.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun find-active-vocab-mp3s (&optional (source-list *mp3dir*))
    (mapcar (lambda (key)
              (unless (assoc key *mp3-alist*)
                (find-matching-mp3 key)))
            source-list))
#+END_SRC
#+RESULTS:
: FIND-ACTIVE-VOCAB-MP3S

*** play-mp3
Launch a thread that runs a program with the appropriate filename as returned by
an association list lookup.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun play-mp3 (key)
    (bordeaux-threads:make-thread (lambda ()
                                    (run "/usr/bin/mpg123"
                                         (cdr (assoc key *mp3-alist*))))
                                  :name "mp3 playback thread"))
#+END_SRC
#+RESULTS:
: PLAY-MP3

* Testing Facilities
** set comparisons
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun my-subset? (set-x set-y)
    (not (set-difference set-x set-y)))
#+END_SRC
#+RESULTS:
: MY-SUBSET\?

#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun set-equal? (set-x set-y)
    (and (my-subset? set-x set-y)
         (my-subset? set-y set-x)))
#+END_SRC
#+RESULTS:
: SET-EQUAL\?

** load-from-hsk
Useful for bootstrapping vocab-element selection.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun load-from-hsk (hsk-val &optional (n 10))
    (let ((base (length *test-pool*)))
      (setf *test-pool*
            (nconc *test-pool*
                   (subseq (reverse (hsk-apropos hsk-val))
                           base
                           (+ n base))))))
#+END_SRC
#+RESULTS:
: LOAD-FROM-HSK

** enumerate-qualified-elements
Check the number of elements that have qualified since the last test occurred,
This is used to check to see if the minimal number of elements required for a
test can be called in without overlapping cooldown-times.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun enumerate-qualified-elements ()
    (length (remove-if-not #'qualified-p *test-pool*)))
#+END_SRC
#+RESULTS:
: ENUMERATE-QUALIFIED-ELEMENTS

