cl-cvd.html

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> fill-mp3-paths</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Set the variable <code>*mp3dir*</code> to be a list of paths to each of the MP3s for the
vocab tests.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">fill-mp3-paths</span> <span style="color: #BFEBBF;">()</span>
  <span style="color: #BFEBBF;">(</span>setf *mp3dir* <span style="color: #D0BF8F;">(</span>directory #P<span style="color: #CC9393;">"~/chinese/hsk_mp3/*.mp3"</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  nil<span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> matching vocab entries to mp3s</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1">find-mp3-path</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
Search a list of mp3 files for a match with a predefined pinyin string.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">find-mp3-path</span> <span style="color: #BFEBBF;">(</span>match-name<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>iterate <span style="color: #D0BF8F;">(</span>for elt in *mp3dir*<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>finding elt such-that <span style="color: #93E0E3;">(</span>scan match-name <span style="color: #9FC59F;">(</span>namestring elt<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2">find-matching-mp3</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
Match a given vocabulary key to a list of mp3 files
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">find-matching-mp3</span> <span style="color: #BFEBBF;">(</span>vocab-key<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let*</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>vocab-entry <span style="color: #9FC59F;">(</span>gethash vocab-key *zh-hash-table*<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #93E0E3;">(</span>pinyin <span style="color: #9FC59F;">(</span>vocab-entry-pinyin vocab-entry<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #93E0E3;">(</span>nospace <span style="color: #9FC59F;">(</span>regex-replace <span style="color: #CC9393;">" "</span> pinyin <span style="color: #CC9393;">""</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #93E0E3;">(</span>match-name <span style="color: #9FC59F;">(</span>concatenate 'string <span style="color: #CC9393;">"-"</span> nospace <span style="color: #CC9393;">"-"</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #93E0E3;">(</span>mp3-path <span style="color: #9FC59F;">(</span>find-mp3-path match-name<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> mp3-path
      <span style="color: #93E0E3;">(</span>push <span style="color: #9FC59F;">(</span>list vocab-key
                  <span style="color: #94BFF3;">(</span>namestring mp3-path<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
            *mp3-alist*<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3-3" class="outline-4">
<h4 id="sec-5-3-3">find-active-vocab-mp3s</h4>
<div class="outline-text-4" id="text-5-3-3">
<p>
Look for mp3s which match the contents of the <code>*mp3dir*</code> variable, if it is not
already in the <code>*mp3-alist*</code>, add it in the form of <code>(KEY PATH-TO-MP3)</code>.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">find-active-vocab-mp3s</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB;">&amp;optional</span> <span style="color: #D0BF8F;">(</span>source-list *mp3dir*<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>mapcar <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #93E0E3;">(</span>key<span style="color: #93E0E3;">)</span>
            <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">unless</span> <span style="color: #9FC59F;">(</span>assoc key *mp3-alist*<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>find-matching-mp3 key<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
          source-list<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3-4" class="outline-4">
<h4 id="sec-5-3-4">play-mp3</h4>
<div class="outline-text-4" id="text-5-3-4">
<p>
Launch a thread that runs a program with the appropriate filename as returned by
an association list lookup.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">play-mp3</span> <span style="color: #BFEBBF;">(</span>key<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>bordeaux-threads:make-thread <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #93E0E3;">()</span>
                                  <span style="color: #93E0E3;">(</span>run <span style="color: #CC9393;">"/usr/bin/mpg123"</span>
                                       <span style="color: #9FC59F;">(</span>cdr <span style="color: #94BFF3;">(</span>assoc key *mp3-alist*<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
                                <span style="color: #DCDCCC; font-weight: bold;">:name</span> <span style="color: #CC9393;">"mp3 playback thread"</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Testing Facilities</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> set comparisons</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">my-subset?</span> <span style="color: #BFEBBF;">(</span>set-x set-y<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>not <span style="color: #D0BF8F;">(</span>set-difference set-x set-y<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">set-equal?</span> <span style="color: #BFEBBF;">(</span>set-x set-y<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>and <span style="color: #D0BF8F;">(</span>my-subset? set-x set-y<span style="color: #D0BF8F;">)</span>
       <span style="color: #D0BF8F;">(</span>my-subset? set-y set-x<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> load-from-hsk</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Useful for bootstrapping vocab-element selection.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">load-from-hsk</span> <span style="color: #BFEBBF;">(</span>hsk-val <span style="color: #7CB8BB;">&amp;optional</span> <span style="color: #D0BF8F;">(</span>n 10<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>base <span style="color: #9FC59F;">(</span>length *test-pool*<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>setf *test-pool*
          <span style="color: #93E0E3;">(</span>nconc *test-pool*
                 <span style="color: #9FC59F;">(</span>subseq <span style="color: #94BFF3;">(</span>reverse <span style="color: #E0CF9F;">(</span>hsk-apropos hsk-val<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
                         base
                         <span style="color: #94BFF3;">(</span>+ n base<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> enumerate-qualified-elements</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Check the number of elements that have qualified since the last test occurred,
This is used to check to see if the minimal number of elements required for a
test can be called in without overlapping cooldown-times.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">enumerate-qualified-elements</span> <span style="color: #BFEBBF;">()</span>
  <span style="color: #BFEBBF;">(</span>length <span style="color: #D0BF8F;">(</span>remove-if-not #'qualified-p *test-pool*<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
