cl-cvd.org
** refil-testing-pool
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun refil-testing-pool (hsk upper-bound)
    (load-from-hsk hsk (- upper-bound (enumerate-qualified-elements))))
#+END_SRC

#+RESULTS:
: REFIL-TESTING-POOL

** hsk-spillover
When a testing level is exhausted, pull more from the next level up.
If there are no more levels, don't increment.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun hsk-spillover ()
    (if (and (hsk-apropos (+ *current-hsk-level* 1))
             (set-equal-p *test-pool* (hsk-apropos *current-hsk-level*)))
        (incf *current-hsk-level*)
        (format nil "Takeshi: ``Amazing!''")))
#+END_SRC
#+RESULTS:
: HSK-SPILLOVER

** Vocab element qualification
*** count-spaces
Determine the complexity of an example by counting the spaces in a string. This
is used to determine if one should be expected to enter the english equivalent
of a selected Chinese text sample.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun count-spaces (str)
    (let ((space-count 0))
      (iterate (for chr in-string str)
        (when (char= chr #\SPACE)
          (incf space-count))
        (finally (return space-count)))))
#+END_SRC
#+RESULTS:
: COUNT-SPACES

*** english-sensible-p
Check to see if any constituents of the english parameter of a particular entry
can be expected to be remembered verbatim and entered when prompted for an
English answer. Perhaps this could be mitigated with a check against a digital
thesaurus.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun english-sensible-p (vocab-entry)
    (element-of-truth (mapcar (lambda (s)
                                (< (count-spaces s) 2))
                              (vocab-entry-english vocab-entry))))
#+END_SRC
#+RESULTS:
: ENGLISH-SENSIBLE-P

*** sensible-tests
A bit crude, but return a list of appropriate tests based on the response of
=english-sensible-p=.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun sensible-tests (vocab-element)
    (if (english-qualified-p vocab-element)
        (list 'english 'hanzi 'pinyin)
        (list 'hanzi 'pinyin)))
#+END_SRC
#+RESULTS:
: SENSIBLE-TESTS

*** qualified-p
Test to see which vocabulary elements qualify for testing at a given time.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun qualified-p (vocab-struct)
    (and (> 10 (vocab-entry-reps vocab-struct))
         (> (get-universal-time)
            (vocab-entry-date vocab-struct))))
#+END_SRC
#+RESULTS:
: QUALIFIED-P

*** set-next-test
Set the =:date= slot in a given vocab structure to the next scheduled test based
upon the number of times it has been correctly answered.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun set-next-test (vocab-struct)
    (setf (vocab-entry-date vocab-struct)
          (schedule-next-test vocab-struct)))
#+END_SRC
#+RESULTS:
: SET-NEXT-TEST

** Presentation
