cl-cvd.html
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> refil-testing-pool</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">refil-testing-pool</span> <span style="color: #BFEBBF;">(</span>hsk upper-bound<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>load-from-hsk hsk <span style="color: #D0BF8F;">(</span>- upper-bound <span style="color: #93E0E3;">(</span>enumerate-qualified-elements<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> hsk-spillover</h3>
<div class="outline-text-3" id="text-6-5">
<p>
When a testing level is exhausted, pull more from the next level up.
If there are no more levels, don't increment.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">hsk-spillover</span> <span style="color: #BFEBBF;">()</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #D0BF8F;">(</span>and <span style="color: #93E0E3;">(</span>hsk-apropos <span style="color: #9FC59F;">(</span>+ *current-hsk-level* 1<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
           <span style="color: #93E0E3;">(</span>set-equal-p *test-pool* <span style="color: #9FC59F;">(</span>hsk-apropos *current-hsk-level*<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>incf *current-hsk-level*<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>format nil <span style="color: #CC9393;">"Takeshi: ``</span><span style="color: #BFEBBF;">Amazing!</span><span style="color: #CC9393;">''"</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> Vocab element qualification</h3>
<div class="outline-text-3" id="text-6-6">
</div><div id="outline-container-sec-6-6-1" class="outline-4">
<h4 id="sec-6-6-1">count-spaces</h4>
<div class="outline-text-4" id="text-6-6-1">
<p>
Determine the complexity of an example by counting the spaces in a string. This
is used to determine if one should be expected to enter the english equivalent
of a selected Chinese text sample.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">count-spaces</span> <span style="color: #BFEBBF;">(</span>str<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>space-count 0<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>iterate <span style="color: #93E0E3;">(</span>for chr in-string str<span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #9FC59F;">(</span>char= chr #\SPACE<span style="color: #9FC59F;">)</span>
        <span style="color: #9FC59F;">(</span>incf space-count<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>finally <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">return</span> space-count<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-6-2" class="outline-4">
<h4 id="sec-6-6-2">english-sensible-p</h4>
<div class="outline-text-4" id="text-6-6-2">
<p>
Check to see if any constituents of the english parameter of a particular entry
can be expected to be remembered verbatim and entered when prompted for an
English answer. Perhaps this could be mitigated with a check against a digital
thesaurus.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">english-sensible-p</span> <span style="color: #BFEBBF;">(</span>vocab-entry<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>element-of-truth <span style="color: #D0BF8F;">(</span>mapcar <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #9FC59F;">(</span>s<span style="color: #9FC59F;">)</span>
                              <span style="color: #9FC59F;">(</span>&lt; <span style="color: #94BFF3;">(</span>count-spaces s<span style="color: #94BFF3;">)</span> 2<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
                            <span style="color: #93E0E3;">(</span>vocab-entry-english vocab-entry<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-6-3" class="outline-4">
<h4 id="sec-6-6-3">sensible-tests</h4>
<div class="outline-text-4" id="text-6-6-3">
<p>
A bit crude, but return a list of appropriate tests based on the response of
<code>english-sensible-p</code>.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">sensible-tests</span> <span style="color: #BFEBBF;">(</span>vocab-element<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #D0BF8F;">(</span>english-qualified-p vocab-element<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>list 'english 'hanzi 'pinyin<span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span>list 'hanzi 'pinyin<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-6-4" class="outline-4">
<h4 id="sec-6-6-4">qualified-p</h4>
<div class="outline-text-4" id="text-6-6-4">
<p>
Test to see which vocabulary elements qualify for testing at a given time.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">qualified-p</span> <span style="color: #BFEBBF;">(</span>vocab-struct<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>and <span style="color: #D0BF8F;">(</span>&gt; 10 <span style="color: #93E0E3;">(</span>vocab-entry-reps vocab-struct<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
       <span style="color: #D0BF8F;">(</span>&gt; <span style="color: #93E0E3;">(</span>get-universal-time<span style="color: #93E0E3;">)</span>
          <span style="color: #93E0E3;">(</span>vocab-entry-date vocab-struct<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-6-5" class="outline-4">
<h4 id="sec-6-6-5">set-next-test</h4>
<div class="outline-text-4" id="text-6-6-5">
<p>
Set the <code>:date</code> slot in a given vocab structure to the next scheduled test based
upon the number of times it has been correctly answered.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">set-next-test</span> <span style="color: #BFEBBF;">(</span>vocab-struct<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>setf <span style="color: #D0BF8F;">(</span>vocab-entry-date vocab-struct<span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span>schedule-next-test vocab-struct<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
