cl-cvd.org
*** show-challenge
Take a =field= and =key=, and respond with a string from the requested
field. A field value of =english= will return a random string from the list
located in the =:english= field of the selected =vocab-entry=, and =english-all=
will return a string containing all the elements of the list. A value of
=pinyin= will return a pinyin string, and =hanzi= will return the Chinese
ideographs.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun show-challenge (&key field key (hash-table *zh-hash-table*))
    (let ((the-object (gethash key hash-table)))
      (case field
        ((english)     (nth (random (length (vocab-entry-english the-object)))
                            (vocab-entry-english the-object)))
        ((english-all) (format nil "~{~A~^, ~}." (vocab-entry-english the-object)))
        ((pinyin)      (vocab-entry-pinyin the-object))
        ((hanzi)       (vocab-entry-hanzi the-object)))))
#+END_SRC
#+RESULTS:
: SHOW-CHALLENGE

*** take-answer
A simple silly test.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun take-answer (&key test)
    (format t "~D> " test)
    (read-line))
#+END_SRC
#+RESULTS:
: TAKE-ANSWER

** List construction
*** construct-test-list
Build up a sample of vocab items for a test battery.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun construct-test-list (length &key (test-pool *test-pool*) (vocab *zh-hash-table*))
    "Construct a test list of LENGTH members"
    (let ((repeat 0)
          (result))
      (iterate (for key in test-pool)
        (if (= repeat length)
            result
            (when (qualified-p (gethash key vocab))
              (incf repeat)
              (collect key into result at beginning))))))
#+END_SRC
#+RESULTS:
: CONSTRUCT-TEST-LIST

*** reconstruct-test-pool
Rebuild the testing pool from the base vocab library by searching for items that
have already been seen in practice.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun reconstruct-test-pool ()
    (maphash (lambda (key val)
               (when (< 1 (vocab-entry-reps val))
                 (push key *test-pool*)))
             ,*zh-hash-table*))
#+END_SRC
#+RESULTS:
: RECONSTRUCT-TEST-POOL

** Scoring
*** string-in-list-p
Test to see if a list contains a specified string.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun string-in-list-p (string l)
    (iterate (for s in l)
      (when (string= s string)
        l)))
#+END_SRC
#+RESULTS:
: STRING-IN-LIST-P

*** check-answer
Test a provided answer for correctness against data stored in a vocab-entry instance.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun check-answer (answer vocab-entry test-type)
    (cond ((not (member test-type '(english hanzi pinyin)))
           (error "Unknown test-type"))
          ((and (equalp test-type 'english)
                (string-in-list-p answer (vocab-entry-english vocab-entry))))
          ((and (equalp test-type 'hanzi)
                (string= answer (vocab-entry-hanzi vocab-entry))))
          ((and (equalp test-type 'pinyin)
                (string= answer (vocab-entry-pinyin vocab-entry))))))
#+END_SRC
#+RESULTS:
: CHECK-ANSWER

