cl-cvd.html
<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> Presentation</h3>
<div class="outline-text-3" id="text-6-7">
</div><div id="outline-container-sec-6-7-1" class="outline-4">
<h4 id="sec-6-7-1">show-challenge</h4>
<div class="outline-text-4" id="text-6-7-1">
<p>
Take a <code>field</code> and <code>key</code>, and respond with a string from the requested
field. A field value of <code>english</code> will return a random string from the list
located in the <code>:english</code> field of the selected <code>vocab-entry</code>, and <code>english-all</code>
will return a string containing all the elements of the list. A value of
<code>pinyin</code> will return a pinyin string, and <code>hanzi</code> will return the Chinese
ideographs.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">show-challenge</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB;">&amp;key</span> field key <span style="color: #D0BF8F;">(</span>hash-table *zh-hash-table*<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>the-object <span style="color: #9FC59F;">(</span>gethash key hash-table<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">case</span> field
      <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>english<span style="color: #9FC59F;">)</span>     <span style="color: #9FC59F;">(</span>nth <span style="color: #94BFF3;">(</span>random <span style="color: #E0CF9F;">(</span>length <span style="color: #8FB28F;">(</span>vocab-entry-english the-object<span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
                          <span style="color: #94BFF3;">(</span>vocab-entry-english the-object<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>english-all<span style="color: #9FC59F;">)</span> <span style="color: #9FC59F;">(</span>format nil <span style="color: #CC9393;">"~{~A~^, ~}."</span> <span style="color: #94BFF3;">(</span>vocab-entry-english the-object<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>pinyin<span style="color: #9FC59F;">)</span>      <span style="color: #9FC59F;">(</span>vocab-entry-pinyin the-object<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>hanzi<span style="color: #9FC59F;">)</span>       <span style="color: #9FC59F;">(</span>vocab-entry-hanzi the-object<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-7-2" class="outline-4">
<h4 id="sec-6-7-2">take-answer</h4>
<div class="outline-text-4" id="text-6-7-2">
<p>
A simple silly test.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">take-answer</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB;">&amp;key</span> test<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>format t <span style="color: #CC9393;">"~D&gt; "</span> test<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>read-line<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="section-number-3">6.8</span> List construction</h3>
<div class="outline-text-3" id="text-6-8">
</div><div id="outline-container-sec-6-8-1" class="outline-4">
<h4 id="sec-6-8-1">construct-test-list</h4>
<div class="outline-text-4" id="text-6-8-1">
<p>
Build up a sample of vocab items for a test battery.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">construct-test-list</span> <span style="color: #BFEBBF;">(</span>length <span style="color: #7CB8BB;">&amp;key</span> <span style="color: #D0BF8F;">(</span>test-pool *test-pool*<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>vocab *zh-hash-table*<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #9FC59F;">"Construct a test list of LENGTH members"</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>repeat 0<span style="color: #93E0E3;">)</span>
        <span style="color: #93E0E3;">(</span>result<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>iterate <span style="color: #93E0E3;">(</span>for key in test-pool<span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #9FC59F;">(</span>= repeat length<span style="color: #9FC59F;">)</span>
          result
          <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #94BFF3;">(</span>qualified-p <span style="color: #E0CF9F;">(</span>gethash key vocab<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
            <span style="color: #94BFF3;">(</span>incf repeat<span style="color: #94BFF3;">)</span>
            <span style="color: #94BFF3;">(</span>collect key into result at beginning<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-8-2" class="outline-4">
<h4 id="sec-6-8-2">reconstruct-test-pool</h4>
<div class="outline-text-4" id="text-6-8-2">
<p>
Rebuild the testing pool from the base vocab library by searching for items that
have already been seen in practice.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">reconstruct-test-pool</span> <span style="color: #BFEBBF;">()</span>
  <span style="color: #BFEBBF;">(</span>maphash <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #93E0E3;">(</span>key val<span style="color: #93E0E3;">)</span>
             <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #9FC59F;">(</span>&lt; 1 <span style="color: #94BFF3;">(</span>vocab-entry-reps val<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
               <span style="color: #9FC59F;">(</span>push key *test-pool*<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
           *zh-hash-table*<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6-9" class="outline-3">
<h3 id="sec-6-9"><span class="section-number-3">6.9</span> Scoring</h3>
<div class="outline-text-3" id="text-6-9">
</div><div id="outline-container-sec-6-9-1" class="outline-4">
<h4 id="sec-6-9-1">string-in-list-p</h4>
<div class="outline-text-4" id="text-6-9-1">
<p>
Test to see if a list contains a specified string.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">string-in-list-p</span> <span style="color: #BFEBBF;">(</span>string l<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>iterate <span style="color: #D0BF8F;">(</span>for s in l<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #93E0E3;">(</span>string= s string<span style="color: #93E0E3;">)</span>
      l<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-9-2" class="outline-4">
<h4 id="sec-6-9-2">check-answer</h4>
<div class="outline-text-4" id="text-6-9-2">
<p>
Test a provided answer for correctness against data stored in a vocab-entry instance.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">check-answer</span> <span style="color: #BFEBBF;">(</span>answer vocab-entry test-type<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">cond</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>not <span style="color: #9FC59F;">(</span>member test-type '<span style="color: #94BFF3;">(</span>english hanzi pinyin<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #93E0E3;">(</span><span style="color: #D0BF8F; font-weight: bold;">error</span> <span style="color: #CC9393;">"Unknown test-type"</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equalp test-type 'english<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>string-in-list-p answer <span style="color: #94BFF3;">(</span>vocab-entry-english vocab-entry<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equalp test-type 'hanzi<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>string= answer <span style="color: #94BFF3;">(</span>vocab-entry-hanzi vocab-entry<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
        <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>and <span style="color: #9FC59F;">(</span>equalp test-type 'pinyin<span style="color: #9FC59F;">)</span>
              <span style="color: #9FC59F;">(</span>string= answer <span style="color: #94BFF3;">(</span>vocab-entry-pinyin vocab-entry<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
