cl-cvd.org
*** score-result
Return a complex number, depending the state of =result=, that is added to the
score stored in a specific =vocab-entry= structure. The left side of the complex
is Correct, the right is Incorrect.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun score-result (result)
    (if result
        1
        #C(0 1)))
#+END_SRC
#+RESULTS:
: SCORE-RESULT

*** determine-offset
Determine the offset for scheduling from anywhere between minutes to weeks based
on the ratio between the real and imaginary components of the complex number
stored in the =:score= slot. This is used to grade understanding between at
least four categories: unknown, poorly known, somewhat known, and known.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun determine-offset (c)
      (let ((ratio (/ (realpart c) (imagpart c))))
        (cond ((<= ratio 1)  3600)
              ((<= ratio 2)  7200)
              ((<= ratio 5)  10800)
              ((<= ratio 10) 28000))))
#+END_SRC
#+RESULTS:
: DETERMINE-OFFSET

*** schedule-next-test
Determine when a word should be tested next based on the number of repetitions,
and adjust this based on the score.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun schedule-next-test (reps score)
    (round
     (+ (get-universal-time)
        (* (+ 7200
              (determine-offset score) 
              (expt phi (/ reps 2)))))))
#+END_SRC
#+RESULTS:
: SCHEDULE-NEXT-TEST

** display-and-play
Print the Challenge to the screen, then prompt the user for the selected test,
and play the sound file associated with the vocab entry. Update the score stored
in the vocab-entry structure to reflect the correctness of the answer.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun display-and-play (&key key from for)
    (let ((goal      (show-challenge :field for :key key))
          (challenge (show-challenge :field from :key key)))
      (play-mp3 key)
      (format t "~D~%~D> " challenge for)
      (let* ((vocab-entry (gethash key *zh-hash-table*))
             (results     (check-answer (get-answer) vocab-entry for))
             (reps        (vocab-entry-reps vocab-entry)))
        (setf (vocab-entry-score vocab-entry)
              (+ (score-result results)
                 (vocab-entry-score vocab-entry)))
        (if results
            (progn (setf (vocab-entry-date vocab-entry)
                         (schedule-next-test reps
                                             (vocab-entry-score vocab-entry)))
                   (incf reps))
            (progn (setf *test-pool*
                         (reverse (cons key (reverse *test-pool*))))
                   goal)))))
#+END_SRC
#+RESULTS:
: DISPLAY-AND-PLAY

**** get-answer
Just having a call to =read-line= has some strange effects on program flow, so
I'm wrapping it in a function.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun get-answer ()
    (read-line))
#+END_SRC
#+RESULTS:
: GET-ANSWER

