cl-cvd.html
<div id="outline-container-sec-6-9-3" class="outline-4">
<h4 id="sec-6-9-3">score-result</h4>
<div class="outline-text-4" id="text-6-9-3">
<p>
Return a complex number, depending the state of <code>result</code>, that is added to the
score stored in a specific <code>vocab-entry</code> structure. The left side of the complex
is Correct, the right is Incorrect.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">score-result</span> <span style="color: #BFEBBF;">(</span>result<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> result
      1
      #C<span style="color: #D0BF8F;">(</span>0 1<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-9-4" class="outline-4">
<h4 id="sec-6-9-4">determine-offset</h4>
<div class="outline-text-4" id="text-6-9-4">
<p>
Determine the offset for scheduling from anywhere between minutes to weeks based
on the ratio between the real and imaginary components of the complex number
stored in the <code>:score</code> slot. This is used to grade understanding between at
least four categories: unknown, poorly known, somewhat known, and known.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">determine-offset</span> <span style="color: #BFEBBF;">(</span>c<span style="color: #BFEBBF;">)</span>
    <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>ratio <span style="color: #9FC59F;">(</span>/ <span style="color: #94BFF3;">(</span>realpart c<span style="color: #94BFF3;">)</span> <span style="color: #94BFF3;">(</span>imagpart c<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
      <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">cond</span> <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>&lt;= ratio 1<span style="color: #9FC59F;">)</span>  3600<span style="color: #93E0E3;">)</span>
            <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>&lt;= ratio 2<span style="color: #9FC59F;">)</span>  7200<span style="color: #93E0E3;">)</span>
            <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>&lt;= ratio 5<span style="color: #9FC59F;">)</span>  10800<span style="color: #93E0E3;">)</span>
            <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>&lt;= ratio 10<span style="color: #9FC59F;">)</span> 28000<span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-9-5" class="outline-4">
<h4 id="sec-6-9-5">schedule-next-test</h4>
<div class="outline-text-4" id="text-6-9-5">
<p>
Determine when a word should be tested next based on the number of repetitions,
and adjust this based on the score.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">schedule-next-test</span> <span style="color: #BFEBBF;">(</span>reps score<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span>round
   <span style="color: #D0BF8F;">(</span>+ <span style="color: #93E0E3;">(</span>get-universal-time<span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>* <span style="color: #9FC59F;">(</span>+ 7200
            <span style="color: #94BFF3;">(</span>determine-offset score<span style="color: #94BFF3;">)</span> 
            <span style="color: #94BFF3;">(</span>expt phi <span style="color: #E0CF9F;">(</span>/ reps 2<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6-10" class="outline-3">
<h3 id="sec-6-10"><span class="section-number-3">6.10</span> display-and-play</h3>
<div class="outline-text-3" id="text-6-10">
<p>
Print the Challenge to the screen, then prompt the user for the selected test,
and play the sound file associated with the vocab entry. Update the score stored
in the vocab-entry structure to reflect the correctness of the answer.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">display-and-play</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB;">&amp;key</span> key from for<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>goal      <span style="color: #9FC59F;">(</span>show-challenge <span style="color: #DCDCCC; font-weight: bold;">:field</span> for <span style="color: #DCDCCC; font-weight: bold;">:key</span> key<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
        <span style="color: #93E0E3;">(</span>challenge <span style="color: #9FC59F;">(</span>show-challenge <span style="color: #DCDCCC; font-weight: bold;">:field</span> from <span style="color: #DCDCCC; font-weight: bold;">:key</span> key<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>play-mp3 key<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>format t <span style="color: #CC9393;">"~D~%~D&gt; "</span> challenge for<span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span><span style="color: #F0DFAF; font-weight: bold;">let*</span> <span style="color: #93E0E3;">(</span><span style="color: #9FC59F;">(</span>vocab-entry <span style="color: #94BFF3;">(</span>gethash key *zh-hash-table*<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
           <span style="color: #9FC59F;">(</span>results     <span style="color: #94BFF3;">(</span><span style="color: #D0BF8F; font-weight: bold;">check-answer</span> <span style="color: #E0CF9F;">(</span>get-answer<span style="color: #E0CF9F;">)</span> vocab-entry for<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
           <span style="color: #9FC59F;">(</span>reps        <span style="color: #94BFF3;">(</span>vocab-entry-reps vocab-entry<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span>setf <span style="color: #9FC59F;">(</span>vocab-entry-score vocab-entry<span style="color: #9FC59F;">)</span>
            <span style="color: #9FC59F;">(</span>+ <span style="color: #94BFF3;">(</span>score-result results<span style="color: #94BFF3;">)</span>
               <span style="color: #94BFF3;">(</span>vocab-entry-score vocab-entry<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> results
          <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span> <span style="color: #94BFF3;">(</span>setf <span style="color: #E0CF9F;">(</span>vocab-entry-date vocab-entry<span style="color: #E0CF9F;">)</span>
                       <span style="color: #E0CF9F;">(</span>schedule-next-test reps
                                           <span style="color: #8FB28F;">(</span>vocab-entry-score vocab-entry<span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
                 <span style="color: #94BFF3;">(</span>incf reps<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
          <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span> <span style="color: #94BFF3;">(</span>setf *test-pool*
                       <span style="color: #E0CF9F;">(</span>reverse <span style="color: #8FB28F;">(</span>cons key <span style="color: #6CA0A3;">(</span>reverse *test-pool*<span style="color: #6CA0A3;">)</span><span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
                 goal<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
<ul class="org-ul"><li><a id="sec-6-10-0-1" name="sec-6-10-0-1"></a>get-answer<br  /><div class="outline-text-5" id="text-6-10-0-1">
<p>
Just having a call to <code>read-line</code> has some strange effects on program flow, so
I'm wrapping it in a function.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">get-answer</span> <span style="color: #BFEBBF;">()</span>
  <span style="color: #BFEBBF;">(</span>read-line<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</li></ul>
</div>
