cl-cvd.org
** test-loop
Loop through a set of tests where the test type is indeterminate.
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun test-loop (&optional (n 10) (type 'random))
    (let ((test-list (construct-test-list n)))
      (iterate (for elt in test-list)
        (when (> n 0)
          (1- n)
          (case type
            ((random) (random-test elt))
            ((t) (display-and-play :key elt :from 'pinyin :for 'hanzi)))))))
#+END_SRC
#+RESULTS:
: TEST-LOOP

** random-test
#+BEGIN_SRC lisp :session :eval yes :tangle cl-cvd.lisp
  (defun random-test (key)
    (let* ((test-list (list 'hanzi 'pinyin 'english))
           (crazy-english (list 'hanzi 'pinyin))
           (sane-for (if (english-sensible-p (gethash key *zh-hash-table*))
                         (nth (random (length test-list)) test-list)
                         (nth (random (length crazy-english)) crazy-english)))
           (rest-tests (delete sane-for test-list))
           (from (nth (random (length rest-tests)) rest-tests)))
      (display-and-play :key key :from from :for sane-for)))
#+END_SRC
#+RESULTS:
: RANDOM-TEST

* User Interface
** Header
#+BEGIN_SRC lisp :session :eval no :tangle cl-cvd-gui.lisp
  ;; This is the source for the GUI front-end of the Chinese Vocab Drill
  ;; package. It uses GTK+ 3.x via CFFI.
  (in-package :cl-cvd)
#+END_SRC
