cl-cvd.html
<div id="outline-container-sec-6-11" class="outline-3">
<h3 id="sec-6-11"><span class="section-number-3">6.11</span> test-loop</h3>
<div class="outline-text-3" id="text-6-11">
<p>
Loop through a set of tests where the test type is indeterminate.
</p>
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">test-loop</span> <span style="color: #BFEBBF;">(</span><span style="color: #7CB8BB;">&amp;optional</span> <span style="color: #D0BF8F;">(</span>n 10<span style="color: #D0BF8F;">)</span> <span style="color: #D0BF8F;">(</span>type 'random<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>test-list <span style="color: #9FC59F;">(</span>construct-test-list n<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>iterate <span style="color: #93E0E3;">(</span>for elt in test-list<span style="color: #93E0E3;">)</span>
      <span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #9FC59F;">(</span>&gt; n 0<span style="color: #9FC59F;">)</span>
        <span style="color: #9FC59F;">(</span>1- n<span style="color: #9FC59F;">)</span>
        <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">case</span> type
          <span style="color: #94BFF3;">(</span><span style="color: #E0CF9F;">(</span>random<span style="color: #E0CF9F;">)</span> <span style="color: #E0CF9F;">(</span>random-test elt<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
          <span style="color: #94BFF3;">(</span><span style="color: #E0CF9F;">(</span>t<span style="color: #E0CF9F;">)</span> <span style="color: #E0CF9F;">(</span>display-and-play <span style="color: #DCDCCC; font-weight: bold;">:key</span> elt <span style="color: #DCDCCC; font-weight: bold;">:from</span> 'pinyin <span style="color: #DCDCCC; font-weight: bold;">:for</span> 'hanzi<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-12" class="outline-3">
<h3 id="sec-6-12"><span class="section-number-3">6.12</span> random-test</h3>
<div class="outline-text-3" id="text-6-12">
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">random-test</span> <span style="color: #BFEBBF;">(</span>key<span style="color: #BFEBBF;">)</span>
  <span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">let*</span> <span style="color: #D0BF8F;">(</span><span style="color: #93E0E3;">(</span>test-list <span style="color: #9FC59F;">(</span>list 'hanzi 'pinyin 'english<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #93E0E3;">(</span>crazy-english <span style="color: #9FC59F;">(</span>list 'hanzi 'pinyin<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #93E0E3;">(</span>sane-for <span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #94BFF3;">(</span>english-sensible-p <span style="color: #E0CF9F;">(</span>gethash key *zh-hash-table*<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
                       <span style="color: #94BFF3;">(</span>nth <span style="color: #E0CF9F;">(</span>random <span style="color: #8FB28F;">(</span>length test-list<span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span> test-list<span style="color: #94BFF3;">)</span>
                       <span style="color: #94BFF3;">(</span>nth <span style="color: #E0CF9F;">(</span>random <span style="color: #8FB28F;">(</span>length crazy-english<span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span> crazy-english<span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #93E0E3;">(</span>rest-tests <span style="color: #9FC59F;">(</span>delete sane-for test-list<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
         <span style="color: #93E0E3;">(</span>from <span style="color: #9FC59F;">(</span>nth <span style="color: #94BFF3;">(</span>random <span style="color: #E0CF9F;">(</span>length rest-tests<span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span> rest-tests<span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span>
    <span style="color: #D0BF8F;">(</span>display-and-play <span style="color: #DCDCCC; font-weight: bold;">:key</span> key <span style="color: #DCDCCC; font-weight: bold;">:from</span> from <span style="color: #DCDCCC; font-weight: bold;">:for</span> sane-for<span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> User Interface</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Header</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">This is the source for the GUI front-end of the Chinese Vocab Drill</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">package. It uses GTK+ 3.x via CFFI.</span>
<span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">in-package</span> <span style="color: #DCDCCC; font-weight: bold;">:cl-cvd</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Riley E.</p>
<p class="date">Created: 2014-11-20 Thu 13:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
